In [2]:
# Importing the required libraries

import sqlite3
import pandas as pd
import numpy as np

In [3]:
# Read the code below and write your observation in the next cell

conn = sqlite3.connect('database.sqlite')
cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table'")
print(cursor.fetchall())

cursor.execute("PRAGMA table_info('Salaries')")
cols = cursor.fetchall()
for col in cols:
    print(col[1])

[('Salaries',)]
Id
EmployeeName
JobTitle
BasePay
OvertimePay
OtherPay
Benefits
TotalPay
TotalPayBenefits
Year
Notes
Agency
Status

- sqlite3.connect('database'.sqlit') - Command to connect to the database
- conn.cursor() - You need a cursor object to fetch results. It allows you to keep track of which result set is which.         - cursor.execute("SELECT name FROM sqlite_master WHERE type='table'") - It selects the  name from table sqlite_master table

In [4]:
# Reading the data from database and storing it in the dataframe

df = pd.read_sql_query("""SELECT * FROM Salaries""", conn)
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,,567595.43,567595.43,2011,,San Francisco,
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,,538909.28,538909.28,2011,,San Francisco,
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,,335279.91,335279.91,2011,,San Francisco,
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,,332343.61,332343.61,2011,,San Francisco,
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,,326373.19,326373.19,2011,,San Francisco,

## How to retrieve the top 8 rows from the table?.

### Sql Implementation

In [5]:
output = pd.read_sql_query("""SELECT * FROM Salaries LIMIT 8""", conn)
output

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,,567595.43,567595.43,2011,,San Francisco,
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,,538909.28,538909.28,2011,,San Francisco,
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,,335279.91,335279.91,2011,,San Francisco,
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,,332343.61,332343.61,2011,,San Francisco,
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,,326373.19,326373.19,2011,,San Francisco,
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.00,8601.00,189082.74,,316285.74,316285.74,2011,,San Francisco,
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.90,134426.14,,315981.05,315981.05,2011,,San Francisco,
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.00,51322.50,,307899.46,307899.46,2011,,San Francisco,

### Pandas Implementation

In [6]:
df.iloc[0:8]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,,567595.43,567595.43,2011,,San Francisco,
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,,538909.28,538909.28,2011,,San Francisco,
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,,335279.91,335279.91,2011,,San Francisco,
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,,332343.61,332343.61,2011,,San Francisco,
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,,326373.19,326373.19,2011,,San Francisco,
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602,8601,189083,,316285.74,316285.74,2011,,San Francisco,
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492,89062.9,134426,,315981.05,315981.05,2011,,San Francisco,
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256577,0,51322.5,,307899.46,307899.46,2011,,San Francisco,

## What is the average TotalPay?

### Sql Implementation

In [7]:
output = pd.read_sql_query("""SELECT avg(TotalPay) FROM Salaries """, conn)
output

   avg(TotalPay)
0   74768.321972

### Pandas Implementation

In [98]:
df.loc[df['TotalPay'] == df['TotalPay'].mean(), ['TotalPay']]

Empty DataFrame
Columns: [TotalPay]
Index: []

In [95]:
df['TotalPay'].mean()

74768.321971703

## What is the highest amount of BasePay in the dataset?

### Sql Implementation

In [37]:
#SELECT First_Name, CAST(Score AS Integer) Int_Score FROM Student_Score;
output = pd.read_sql_query("""SELECT MAX(BasePay) FROM Salaries WHERE Basepay != 'Not Provided' AND Basepay != '' """, conn)
output

   MAX(BasePay)
0     319275.01

### Pandas Implementation

In [63]:
df.loc[df.BasePay == 'Not Provided' ,'BasePay']  = np.nan

C:\Users\welcome\Anaconda3\lib\site-packages\pandas\core\ops\array_ops.py:253: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  res_values = method(rvalues)

In [64]:
df.loc[df.BasePay == '' ,'BasePay']  = np.nan

In [65]:
df['BasePay'] = pd.to_numeric(df['BasePay'])

In [66]:
max(df['BasePay'])

256576.96

## What is the Job title of 'NATHANIEL FORD'?

### Sql Implementation

In [8]:
output = pd.read_sql_query("""SELECT JobTitle FROM Salaries WHERE EmployeeName == 'NATHANIEL FORD' """, conn)
output

                                         JobTitle
0  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY

### Python Implementation

In [42]:
df.loc[(df.EmployeeName == 'NATHANIEL FORD'),['JobTitle']]

                                         JobTitle
0  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY

## How much 'TotalPayBenefits' is made by 'NATHANIEL FORD'?

### Sql Implementation

In [99]:
output = pd.read_sql_query("""SELECT TotalPayBenefits FROM Salaries where EmployeeName in ('NATHANIEL FORD');""", conn)
output

   TotalPayBenefits
0         567595.43

### Python Implementation

In [103]:
df.loc[(df.EmployeeName == 'NATHANIEL FORD'), ['TotalPayBenefits']]

   TotalPayBenefits
0         567595.43

## What was the average (mean) TotalPay of all employees per year? (Output for each year from 2011 to 2014 separately)

### Sql Implementation

In [34]:
output = pd.read_sql_query("""SELECT avg(TotalPay),Year FROM Salaries GROUP BY Year""", conn)
output

   avg(TotalPay)  Year
0   71744.103871  2011
1   74113.262265  2012
2   77611.443142  2013
3   75463.918140  2014

### Python Implementation

In [19]:
df.groupby('Year').TotalPay.mean()

Year
2011    71744.103871
2012    74113.262265
2013    77611.443142
2014    75463.918140
Name: TotalPay, dtype: float64

## How many unique jobs are there?

### Sql Implementation

In [168]:
output = pd.read_sql_query("""SELECT COUNT (DISTINCT JobTitle) FROM Salaries """, conn)
output

   COUNT (DISTINCT JobTitle)
0                       2159

### Python Implementation

In [170]:
df.JobTitle.nunique()

2159

## What are the top 5 most common jobs?

### Sql Implementation

In [24]:

output = pd.read_sql_query("""SELECT 'JobTitle', COUNT('JobTitle') AS 'value_occurrence' FROM Salaries GROUP BY 'JobTitle' ORDER BY 'value_occurrence' DESC  LIMIT 5 """, conn)
output

  'JobTitle'  value_occurrence
0   JobTitle            148654

### Python Implementation

In [166]:
df.loc[:,'JobTitle'].value_counts()[:6]

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Custodian                       2418
Name: JobTitle, dtype: int64

## How many people have the word Chief in their job title?

### Sql Implementation

In [32]:
output = pd.read_sql_query("""SELECT  COUNT('JobTitle')  FROM Salaries WHERE JobTitle LIKE  "%CHIEF%" """, conn)
output

   COUNT('JobTitle')
0                627

### Python Implementation

In [71]:
j = 0
for i in df["JobTitle"]:
    if 'Chief' in i or 'CHIEF' in i:
        j+=1
        
print(j)

3